CommunityGD32Cores/ArduinoCore-GD32/cores/arduino/gd32/timer.c
/*
    Copyright (c) 2020, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "timer.h"

extern timerhandle_t timerHandle;
extern pwmhandle_t pwmHandle;

timerhandle_t timerHandle = {
    .init                      = Timer_init,
    .start                     = Timer_start,
    .stop                      = Timer_stop,
    .setPeriodTime             = Timer_setPeriodTime,
    .refresh                   = Timer_rfresh,
    .enableUpdateIT            = Timer_enableUpdateIT,
    .enableCaptureIT           = Timer_enableCaptureIT,
    .disableUpdateIT           = Timer_disableUpdateIT,
    .disableCaptureIT          = Timer_disableCaptureIT,
    .interruptHandle           = Timer_updateHandle,
    .captureInterruptHandle[0] = Timer_captureHandle,
    .captureInterruptHandle[1] = Timer_captureHandle,
    .captureInterruptHandle[2] = Timer_captureHandle,
    .captureInterruptHandle[3] = Timer_captureHandle
};

pwmhandle_t pwmHandle = {
    .init            = PWM_init,
    .start           = PWM_start,
    .stop            = PWM_stop,
    .setPeriodCycle  = PWM_setPeriodCycle,
    .enablePWMIT     = PWM_enablePWMIT,
    .disablePWMIT    = PWM_disablePWMIT,
    .interruptHandle = PWM_irqHandle,
    .writeCycleValue = PWM_writeCyclevalue
};

/*!
    \brief      get timer index
    \param[in]  instance: TIMERx(x=0..13)
    \param[out] none
    \retval     timer index
*/
uint32_t getTimerIndex(uint32_t instance)
{
    uint32_t index = 0xFF;
    switch(instance) {
#if defined(TIMER0)
        case TIMER0:
            index = 0;
            break;
#endif
#if defined(TIMER1)
        case TIMER1:
            index = 1;
            break;
#endif
#if defined(TIMER2)
        case TIMER2:
            index = 2;
            break;
#endif
#if defined(TIMER3)
        case TIMER3:
            index = 3;
            break;
#endif
#if defined(TIMER4)
        case TIMER4:
            index = 4;
            break;
#endif
#if defined(TIMER5)
        case TIMER5:
            index = 5;
            break;
#endif
#if defined(TIMER6)
        case TIMER6:
            index = 6;
            break;
#endif
#if defined(TIMER7)
        case TIMER7:
            index = 7;
            break;
#endif
#if defined(TIMER8)
        case TIMER8:
            index = 8;
            break;
#endif
#if defined(TIMER9)
        case TIMER9:
            index = 9;
            break;
#endif
#if defined(TIMER10)
        case TIMER10:
            index = 10;
            break;
#endif
#if defined(TIMER11)
        case TIMER11:
            index = 11;
            break;
#endif
#if defined(TIMER12)
        case TIMER12:
            index = 12;
            break;
#endif
#if defined(TIMER13)
        case TIMER13:
            index = 13;
            break;
#endif
    }
    return index;
}

/*!
    \brief      get timer device from pinname
    \param[in]  instance: PWMx(x=0..11)
    \param[out] nonex
    \retval     pwmDevice_t obj(TIMERx and TIMER_CH_x)
*/
pwmDevice_t getTimerDeviceFromPinname(PinName instance)
{
    uint32_t pinfunction;
    pwmDevice_t pwmDevice;
    pwmDevice.timer = pinmap_peripheral(instance, PinMap_PWM);
    pinfunction = pinmap_function(instance, PinMap_PWM);
    pwmDevice.channel = GD_PIN_CHANNEL_GET(pinfunction);
    return pwmDevice;
}

/*!
    \brief      get pwm index
    \param[in]  instance: pwmDevice_t obj
    \param[out] none
    \retval     pwm index
*/
uint32_t getPWMIndex(pwmDevice_t instance)
{
    uint8_t timer_index = 0xFF;
    uint8_t channel_index = 0xFF;
    timer_index = getTimerIndex(instance.timer);
    switch(instance.channel) {
        case TIMER_CH_0:
            channel_index = 0;
            break;
        case TIMER_CH_1:
            channel_index = 1;
            break;
        case TIMER_CH_2:
            channel_index = 2;
            break;
        case TIMER_CH_3:
            channel_index = 3;
            break;
        default:
            break;
    }
    return (timer_index * 4 + channel_index);
}

/*!
    \brief      enable timer clock
    \param[in]  instance: TIMERx(x=0..13)
    \param[out] none
    \retval     none
*/
void timer_clock_enable(uint32_t instance)
{
    uint32_t temp;
    switch(instance) {
#if defined(TIMER0) && defined(RCU_TIMER0)
        case TIMER0:
            temp = RCU_TIMER0;
            break;
#endif
#if defined(TIMER1) && defined(RCU_TIMER1)
        case TIMER1:
            temp = RCU_TIMER1;
            break;
#endif
#if defined(TIMER2) && defined(RCU_TIMER2)
        case TIMER2:
            temp = RCU_TIMER2;
            break;
#endif
#if defined(TIMER3) && defined(RCU_TIMER3)
        case TIMER3:
            temp = RCU_TIMER3;
            break;
#endif
#if defined(TIMER4) && defined(RCU_TIMER4)
        case TIMER4:
            temp = RCU_TIMER4;
            break;
#endif
#if defined(TIMER5) && defined(RCU_TIMER5)
        case TIMER5:
            temp = RCU_TIMER5;
            break;
#endif
#if defined(TIMER6) && defined(RCU_TIMER6)
        case TIMER6:
            temp = RCU_TIMER6;
            break;
#endif
#if defined(TIMER7) && defined(RCU_TIMER7)
        case TIMER7:
            temp = RCU_TIMER7;
            break;
#endif
#if defined(TIMER8) && defined(RCU_TIMER8)
        case TIMER8:
            temp = RCU_TIMER8;
            break;
#endif
#if defined(TIMER9) && defined(RCU_TIMER9)
        case TIMER9:
            temp = RCU_TIMER9;
            break;
#endif
#if defined(TIMER10) && defined(RCU_TIMER10)
        case TIMER10:
            temp = RCU_TIMER10;
            break;
#endif
#if defined(TIMER11) && defined(RCU_TIMER11)
        case TIMER11:
            temp = RCU_TIMER11;
            break;
#endif
#if defined(TIMER12) && defined(RCU_TIMER12)
        case TIMER12:
            temp = RCU_TIMER12;
            break;
#endif
#if defined(TIMER13) && defined(RCU_TIMER13)
        case TIMER13:
            temp = RCU_TIMER13;
            break;
#endif
        default:
            break;
    }
    rcu_periph_clock_enable(temp);
}

/*!
    \brief      disable timer clock
    \param[in]  instance: TIMERx(x=0..13)
    \param[out] none
    \retval     none
*/
void timer_clock_disable(uint32_t instance)
{
    uint32_t temp;
    switch(instance) {
#if defined(TIMER0) && defined(RCU_TIMER0)
        case TIMER0:
            temp = RCU_TIMER0;
            break;
#endif
#if defined(TIMER1) && defined(RCU_TIMER1)
        case TIMER1:
            temp = RCU_TIMER1;
            break;
#endif
#if defined(TIMER2) && defined(RCU_TIMER2)
        case TIMER2:
            temp = RCU_TIMER2;
            break;
#endif
#if defined(TIMER3) && defined(RCU_TIMER3)
        case TIMER3:
            temp = RCU_TIMER3;
            break;
#endif
#if defined(TIMER4) && defined(RCU_TIMER4)
        case TIMER4:
            temp = RCU_TIMER4;
            break;
#endif
#if defined(TIMER5) && defined(RCU_TIMER5)
        case TIMER5:
            temp = RCU_TIMER5;
            break;
#endif
#if defined(TIMER6) && defined(RCU_TIMER6)
        case TIMER6:
            temp = RCU_TIMER6;
            break;
#endif
#if defined(TIMER7) && defined(RCU_TIMER7)
        case TIMER7:
            temp = RCU_TIMER7;
            break;
#endif
#if defined(TIMER8) && defined(RCU_TIMER8)
        case TIMER8:
            temp = RCU_TIMER8;
            break;
#endif
#if defined(TIMER9) && defined(RCU_TIMER9)
        case TIMER9:
            temp = RCU_TIMER9;
            break;
#endif
#if defined(TIMER10) && defined(RCU_TIMER10)
        case TIMER10:
            temp = RCU_TIMER10;
            break;
#endif
#if defined(TIMER11) && defined(RCU_TIMER11)
        case TIMER11:
            temp = RCU_TIMER11;
            break;
#endif
#if defined(TIMER12) && defined(RCU_TIMER12)
        case TIMER12:
            temp = RCU_TIMER12;
            break;
#endif
#if defined(TIMER13) && defined(RCU_TIMER13)
        case TIMER13:
            temp = RCU_TIMER13;
            break;
#endif
        default:
            break;
    }
    rcu_periph_clock_disable(temp);
}

/*!
    \brief      initialize timer
    \param[in]  instance: TIMERx(x=0..13)
    \param[in]  timerPeriod: period and format
    \param[out] none
    \retval     none
*/
void Timer_init(uint32_t instance, timerPeriod_t *timerPeriod)
{
    timer_parameter_struct timer_initpara;

    nvic_irq_enable(getTimerUpIrq(instance), 2, 2);
    nvic_irq_enable(getTimerCCIrq(instance), 2, 2);
    timer_clock_enable(instance);
    timer_deinit(instance);
    switch(timerPeriod->format) {
        case FORMAT_US:
            timer_initpara.prescaler = getTimerClkFrequency(instance) / 1000000 - 1;
            timer_initpara.period = timerPeriod->time - 1;
            timer_initpara.repetitioncounter = 0;
            break;
        case FORMAT_MS:
            timer_initpara.prescaler = getTimerClkFrequency(instance) / 10000 - 1;
            timer_initpara.period = timerPeriod->time * 10 - 1;
            timer_initpara.repetitioncounter = 0;
            break;
        case FORMAT_S:
            timer_initpara.prescaler = getTimerClkFrequency(instance) / 10000 - 1;
            timer_initpara.period = timerPeriod->time * 40 - 1 ;
            timer_initpara.repetitioncounter = 250;
            break;
        default:
            break;
    }
    timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection = TIMER_COUNTER_UP;
    timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
    timer_init(instance, &timer_initpara);
}

/*!
    \brief      start timer
    \param[in]  instance: TIMERx(x=0..13)
    \param[out] none
    \retval     none
*/
void Timer_start(uint32_t instance)
{
    timer_enable(instance);
}

/*!
    \brief      stop timer
    \param[in]  instance: TIMERx(x=0..13)
    \param[out] none
    \retval     none
*/
void Timer_stop(uint32_t instance)
{
    timer_disable(instance);
}

/*!
    \brief      set timer period
    \param[in]  instance: TIMERx(x=0..13)
    \param[in]  timerPeriod: time and format
    \param[out] none
    \retval     none
*/
void Timer_setPeriodTime(uint32_t instance, timerPeriod_t *timerPeriod)
{
    uint32_t prescalerfactor = 0;
    uint32_t period_cycle = 0;
    timer_parameter_struct timer_initpara;
    //timer_deinit(instance);
    switch(timerPeriod->format) {
        case FORMAT_TICK:
            timer_initpara.prescaler = TIMER_PSC(instance);
            timer_initpara.period = timerPeriod->time - 1;
            timer_initpara.repetitioncounter  = 0;
            break;
        case FORMAT_US:
            timer_initpara.prescaler = getTimerClkFrequency(instance) / 1000000 - 1;
            timer_initpara.period = timerPeriod->time - 1;
            timer_initpara.repetitioncounter = 0;
            break;
        case FORMAT_MS:
            timer_initpara.prescaler = getTimerClkFrequency(instance) / 10000 - 1;
            timer_initpara.period = timerPeriod->time * 10 - 1;
            timer_initpara.repetitioncounter = 0;
            break;
        case FORMAT_S:
            timer_initpara.prescaler = getTimerClkFrequency(instance) / 10000 - 1;
            timer_initpara.period = timerPeriod->time * 40 - 1;
            timer_initpara.repetitioncounter = 250;
            break;
        case FORMAT_HZ:
            period_cycle = getTimerClkFrequency(instance) / timerPeriod->time;
            prescalerfactor = (period_cycle / 65536) + 1;
            timer_initpara.prescaler = prescalerfactor - 1;
            timer_initpara.period = period_cycle / prescalerfactor;
            timer_initpara.repetitioncounter  = 0;
            break;
        default:
            break;
    }
    timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection = TIMER_COUNTER_UP;
    timer_initpara.clockdivision = TIMER_CKDIV_DIV1;

    timer_init(instance, &timer_initpara);
}

/*!
    \brief      update some registers to restart counters
    \param[in]  instance: TIMERx(x=0..13)
    \param[out] none
    \retval     none
*/
void Timer_rfresh(uint32_t instance)
{
    timer_event_software_generate(instance, TIMER_EVENT_SRC_UPG);
}

/*!
    \brief      enable timer update interrupt
    \param[in]  instance: TIMERx(x=0..13)
    \param[out] none
    \retval     none
*/
void Timer_enableUpdateIT(uint32_t instance)
{
    timer_flag_clear(instance, TIMER_INT_FLAG_UP);
    timer_interrupt_enable(instance, TIMER_INT_UP);
}

/*!
    \brief      disable timer update interrupt
    \param[in]  instance: TIMERx(x=0..13)
    \param[out] none
    \retval     none
*/
void Timer_disableUpdateIT(uint32_t instance)
{
    timer_flag_clear(instance, TIMER_INT_FLAG_UP);
    timer_interrupt_disable(instance, TIMER_INT_UP);
}

/*!
    \brief      enable timer channel capture interrupt
    \param[in]  instance: TIMERx(x=0..13)
    \param[in]  channel: TIMERx(x=0..3)
    \param[out] none
    \retval     none
*/
void Timer_enableCaptureIT(uint32_t instance, uint8_t channel)
{
    uint32_t interrupt;
    uint32_t interrupt_flag;
    switch(channel) {
        case 0:
            interrupt = TIMER_INT_CH0;
            interrupt_flag = TIMER_INT_FLAG_CH0;
            break;
        case 1:
            interrupt = TIMER_INT_CH1;
            interrupt_flag = TIMER_INT_FLAG_CH1;
            break;
        case 2:
            interrupt = TIMER_INT_CH2;
            interrupt_flag = TIMER_INT_FLAG_CH2;
            break;
        case 3:
            interrupt = TIMER_INT_CH3;
            interrupt_flag = TIMER_INT_FLAG_CH3;
            break;
    }
    timer_interrupt_flag_clear(instance, interrupt_flag);
    timer_interrupt_enable(instance, interrupt);
}

/*!
    \brief      disable timer channel capture interrupt
    \param[in]  instance: TIMERx(x=0..13)
    \param[in]  channel: TIMERx(x=0..3)
    \param[out] none
    \retval     none
*/
void Timer_disableCaptureIT(uint32_t instance, uint8_t channel)
{
    uint32_t interrupt;
    uint32_t interrupt_flag;
    switch(channel) {
        case 0:
            interrupt = TIMER_INT_CH0;
            interrupt_flag = TIMER_INT_FLAG_CH0;
            break;
        case 1:
            interrupt = TIMER_INT_CH1;
            interrupt_flag = TIMER_INT_FLAG_CH1;
            break;
        case 2:
            interrupt = TIMER_INT_CH2;
            interrupt_flag = TIMER_INT_FLAG_CH2;
            break;
        case 3:
            interrupt = TIMER_INT_CH3;
            interrupt_flag = TIMER_INT_FLAG_CH3;
            break;
    }
    timer_interrupt_flag_clear(instance, interrupt_flag);
    timer_interrupt_disable(instance, interrupt);
}
/*!
    \brief      initialize pwm
    \param[in]  pwmDevice: pwm device
    \param[in]  pwmPeriodCycle: pwm period and cycle
    \param[out] none
    \retval     none
*/
void PWM_init(pwmDevice_t *pwmDevice, pwmPeriodCycle_t *pwmPeriodCycle)
{
    timer_oc_parameter_struct timer_ocintpara;
    timer_parameter_struct timer_initpara;
    uint32_t periph = pwmDevice->timer;
    nvic_irq_enable(getTimerCCIrq(periph), 2, 2);
    timer_clock_enable(periph);
    rcu_periph_clock_enable(RCU_AF);
    /* configure TIMER base function */
    timer_initpara.prescaler = getTimerClkFrequency(periph) / 1000000 - 1 ;
    timer_initpara.period = 9999;
    timer_initpara.clockdivision = 0;
    timer_initpara.counterdirection = TIMER_COUNTER_UP;
    timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
    timer_init(pwmDevice->timer, &timer_initpara);

    /* configure TIMER channel output function */
    timer_ocintpara.ocpolarity = TIMER_OC_POLARITY_HIGH;
    timer_ocintpara.outputstate = TIMER_CCX_DISABLE;
    timer_ocintpara.ocidlestate = TIMER_OC_IDLE_STATE_LOW;

    timer_channel_output_config(pwmDevice->timer, pwmDevice->channel, &timer_ocintpara);
    timer_channel_output_pulse_value_config(pwmDevice->timer, pwmDevice->channel, 4999);
    timer_channel_output_mode_config(pwmDevice->timer, pwmDevice->channel, TIMER_OC_MODE_PWM0);
    timer_auto_reload_shadow_enable(pwmDevice->timer);
    timer_channel_output_fast_config(pwmDevice->timer, pwmDevice->channel, TIMER_OC_FAST_DISABLE);
    timer_primary_output_config(pwmDevice->timer, ENABLE);

