CommunityGD32Cores/ArduinoCore-GD32/cores/arduino/gd32/timer.c
    timer_enable(periph);
    timer_channel_output_state_config(pwmDevice->timer, pwmDevice->channel, TIMER_CCX_DISABLE);
}

/*!
    \brief      start pwm output
    \param[in]  pwmDevice: pwm device
    \param[out] none
    \retval     none
*/
void PWM_start(pwmDevice_t *pwmDevice)
{
    timer_channel_output_state_config(pwmDevice->timer, pwmDevice->channel, TIMER_CCX_ENABLE);
}

/*!
    \brief      stop pwm output
    \param[in]  pwmDevice: pwm device
    \param[out] none
    \retval     none
*/
void PWM_stop(pwmDevice_t *pwmDevice)
{
    timer_channel_output_state_config(pwmDevice->timer, pwmDevice->channel, TIMER_CCX_DISABLE);
}

/*!
    \brief      set pwm period and cycle
    \param[in]  pwmDevice: pwm device
    \param[in]  pwmPeriodCycle: pwm period and cycle
    \param[out] none
    \retval     none
*/
void PWM_setPeriodCycle(pwmDevice_t *pwmDevice, pwmPeriodCycle_t *pwmPeriodCycle)
{
    uint32_t ccvalue = 0;
    uint32_t prescalerfactor = 0;
    uint32_t period_cycle = 0;
    timer_parameter_struct timer_initpara;
    switch(pwmPeriodCycle->format) {
        case FORMAT_US:
            timer_initpara.prescaler = getTimerClkFrequency(pwmDevice->timer) / 1000000 - 1;
            timer_initpara.period = pwmPeriodCycle->period - 1;
            timer_initpara.repetitioncounter = 0;
            ccvalue = pwmPeriodCycle->cycle;
            break;
        case FORMAT_MS:
            timer_initpara.prescaler = getTimerClkFrequency(pwmDevice->timer) / 10000 - 1;
            timer_initpara.period = pwmPeriodCycle->period * 10 - 1;
            timer_initpara.repetitioncounter = 0;
            ccvalue = pwmPeriodCycle->cycle * 10;
            break;
        case FORMAT_S:
            timer_initpara.prescaler = getTimerClkFrequency(pwmDevice->timer) / 10000 - 1;
            timer_initpara.period = pwmPeriodCycle->period * 40;
            timer_initpara.repetitioncounter = 250;
            ccvalue = pwmPeriodCycle->cycle * 40;
            break;
        case FORMAT_HZ:
            period_cycle = getTimerClkFrequency(pwmDevice->timer) / pwmPeriodCycle->period;
            prescalerfactor = (period_cycle / 65536) + 1;
            timer_initpara.prescaler = prescalerfactor - 1;
            timer_initpara.period = period_cycle / prescalerfactor;
            timer_initpara.repetitioncounter  = 0;
            ccvalue = pwmPeriodCycle->cycle * (timer_initpara.period + 1) / 100.0 ;
            break;
        default:
            break;
    }
    timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection = TIMER_COUNTER_UP;
    timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
    timer_init(pwmDevice->timer, &timer_initpara);
    timer_channel_output_pulse_value_config(pwmDevice->timer, pwmDevice->channel, ccvalue - 1);
}

/*!
    \brief      set pwm  cycle
    \param[in]  pwmDevice: pwm device
    \param[in]  pwmPeriodCycle: pwm period and cycle
    \param[out] none
    \retval     none
*/
void PWM_writeCyclevalue(pwmDevice_t *pwmDevice, pwmPeriodCycle_t *pwmPeriodCycle)
{
    uint32_t value ;

    switch(pwmPeriodCycle->format) {
        case FORMAT_US:
            value = pwmPeriodCycle->cycle;
            break;
        case FORMAT_MS:
            value = pwmPeriodCycle->cycle * 10;
            break;
        case FORMAT_S:
            value = pwmPeriodCycle->cycle * 40;
            break;
        case FORMAT_HZ:
            value = pwmPeriodCycle->cycle / 100.0 * (TIMER_CAR(pwmDevice->timer) + 1);
            break;
        default:
            break;
    }
    timer_channel_output_pulse_value_config(pwmDevice->timer, pwmDevice->channel, value - 1);
}

/*!
    \brief      enable pwm interrupt
    \param[in]  pwmDevice: pwm device
    \param[out] none
    \retval     none
*/
void PWM_enablePWMIT(pwmDevice_t *pwmDevice)
{
    uint32_t interrupt;
    uint32_t interrupt_flag;
    uint16_t ch = pwmDevice->channel;
    switch(ch) {
        case 0:
            interrupt = TIMER_INT_CH0;
            interrupt_flag = TIMER_INT_FLAG_CH0;
            break;
        case 1:
            interrupt = TIMER_INT_CH1;
            interrupt_flag = TIMER_INT_FLAG_CH1;
            break;
        case 2:
            interrupt = TIMER_INT_CH2;
            interrupt_flag = TIMER_INT_FLAG_CH2;
            break;
        case 3:
            interrupt = TIMER_INT_CH3;
            interrupt_flag = TIMER_INT_FLAG_CH3;
            break;
    }
    timer_interrupt_flag_clear(pwmDevice->timer, interrupt_flag);
    timer_interrupt_enable(pwmDevice->timer, interrupt);
}

/*!
    \brief      disable pwm interrupt
    \param[in]  pwmDevice: pwm device
    \param[out] none
    \retval     none
*/
void PWM_disablePWMIT(pwmDevice_t *pwmDevice)
{
    uint32_t interrupt;
    uint32_t interrupt_flag;
    uint16_t ch = pwmDevice->channel;
    switch(ch) {
        case 0:
            interrupt = TIMER_INT_CH0;
            interrupt_flag = TIMER_INT_FLAG_CH0;
            break;
        case 1:
            interrupt = TIMER_INT_CH1;
            interrupt_flag = TIMER_INT_FLAG_CH1;
            break;
        case 2:
            interrupt = TIMER_INT_CH2;
            interrupt_flag = TIMER_INT_FLAG_CH2;
            break;
        case 3:
            interrupt = TIMER_INT_CH3;
            interrupt_flag = TIMER_INT_FLAG_CH3;
            break;
    }
    timer_interrupt_flag_clear(pwmDevice->timer, interrupt_flag);
    timer_interrupt_disable(pwmDevice->timer, interrupt);
}

/*!
    \brief      get timer clock frequency
    \param[in]  instance: TIMERx(x=0..13)
    \param[out] none
    \retval     none
*/
uint32_t getTimerClkFrequency(uint32_t instance)
{
    rcu_clock_freq_enum timerclkSrc =  NC;
    uint32_t APBx_PSC = 0;
    uint32_t clk_src = 0;

    if(instance != (uint32_t) NC) {
        switch((uint32_t)instance) {
#if defined(TIMER0)
            case(uint32_t)TIMER0:
#endif
#if defined(TIMER7)
            case(uint32_t)TIMER7:
#endif
#if defined(TIMER8)
            case(uint32_t)TIMER8:
#endif
#if defined(TIMER9)
            case(uint32_t)TIMER9:
#endif
#if defined(TIMER10)
            case(uint32_t)TIMER10:
#endif
                timerclkSrc = CK_APB2;
                APBx_PSC = (RCU_CFG0 & RCU_CFG0_APB2PSC) >> 11;
                break;
#if defined(TIMER1)
            case(uint32_t)TIMER1:
#endif
#if defined(TIMER2)
            case(uint32_t)TIMER2:
#endif
#if defined(TIMER3)
            case(uint32_t)TIMER3:
#endif
#if defined(TIMER4)
            case(uint32_t)TIMER4:
#endif
#if defined(TIMER5)
            case(uint32_t)TIMER5:
#endif
#if defined(TIMER6)
            case(uint32_t)TIMER6:
#endif
#if defined(TIMER11)
            case(uint32_t)TIMER11:
#endif
#if defined(TIMER12)
            case(uint32_t)TIMER12:
#endif
#if defined(TIMER13)
            case(uint32_t)TIMER13:
#endif
                timerclkSrc = CK_APB1;
                APBx_PSC = (RCU_CFG0 & RCU_CFG0_APB1PSC) >> 8;
                break;
            default:
                break;
        }
    }
    if(0 != (APBx_PSC & 0x04)) {
        clk_src = 2 * rcu_clock_freq_get(timerclkSrc);
    } else {
        clk_src =  rcu_clock_freq_get(timerclkSrc);
    }
    return clk_src;
}

/*!
    \brief      get timer update IRQn
    \param[in]  tim: TIMERx(x=0..13)
    \param[out] none
    \retval     timer update IRQn
*/
IRQn_Type getTimerUpIrq(uint32_t tim)
{
    IRQn_Type IRQn = NonMaskableInt_IRQn;

    if(tim != (uint32_t)NC) {
        switch((uint32_t)tim) {
#if defined(TIMER0) && defined(TIMER0_IRQn)
            case(uint32_t)TIMER0:
                IRQn = TIMER0_IRQn;
                break;
#endif
#if defined(TIMER1) && defined(TIMER1_IRQn)
            case(uint32_t)TIMER1:
                IRQn = TIMER1_IRQn;
                break;
#endif
#if defined(TIMER2) && defined(TIMER2_IRQn)
            case(uint32_t)TIMER2:
                IRQn = TIMER2_IRQn;
                break;
#endif
#if defined(TIMER3) && defined(TIMER3_IRQn)
            case(uint32_t)TIMER3:
                IRQn = TIMER3_IRQn;
                break;
#endif
#if defined(TIMER4) && defined(TIMER4_IRQn)
            case(uint32_t)TIMER4:
                IRQn = TIMER4_IRQn;
                break;
#endif
#if defined(TIMER5) && defined(TIMER5_IRQn)
            case(uint32_t)TIMER5:
                IRQn = TIMER5_IRQn;
                break;
#endif
#if defined(TIMER6) && defined(TIMER6_IRQn)
            case(uint32_t)TIMER6:
                IRQn = TIMER6_IRQn;
                break;
#endif
#if defined(TIMER7) && defined(TIMER7_IRQn)
            case(uint32_t)TIMER7:
                IRQn = TIMER7_IRQn;
                break;
#endif
#if defined(TIMER8) && defined(TIMER8_IRQn)
            case(uint32_t)TIMER8:
                IRQn = TIMER8_IRQn;
                break;
#endif
#if defined(TIMER9) && defined(TIMER9_IRQn)
            case(uint32_t)TIMER9:
                IRQn = TIMER9_IRQn;
                break;
#endif
#if defined(TIMER10) && defined(TIMER10_IRQn)
            case(uint32_t)TIMER10:
                IRQn = TIMER10_IRQn;
                break;
#endif
#if defined(TIMER11) && defined(TIMER11_IRQn)
            case(uint32_t)TIMER11:
                IRQn = TIMER11_IRQn;
                break;
#endif
#if defined(TIMER12) && defined(TIMER12_IRQn)
            case(uint32_t)TIMER12:
                IRQn = TIMER12_IRQn;
                break;
#endif
#if defined(TIMER13) && defined(TIMER13_IRQn)
            case(uint32_t)TIMER13:
                IRQn = TIMER13_IRQn;
                break;
#endif
            default:
                break;
        }
    }
    return IRQn;
}

/*!
    \brief      get timer capture/compare IRQn
    \param[in]  tim: TIMERx(x=0..13)
    \param[out] none
    \retval     timer capture/compare IRQn
*/
IRQn_Type getTimerCCIrq(uint32_t tim)
{
    IRQn_Type IRQn = NonMaskableInt_IRQn;

    if(tim != (uint32_t)NC) {
        switch((uint32_t)tim) {
#if defined(TIMER0) && defined(TIMER0_IRQn)
            case(uint32_t)TIMER0:
                IRQn = TIMER0_Channel_IRQn;
                break;
#endif
#if defined(TIMER1) && defined(TIMER1_IRQn)
            case(uint32_t)TIMER1:
                IRQn = TIMER1_IRQn;
                break;
#endif
#if defined(TIMER2) && defined(TIMER2_IRQn)
            case(uint32_t)TIMER2:
                IRQn = TIMER2_IRQn;
                break;
#endif
#if defined(TIMER3) && defined(TIMER3_IRQn)
            case(uint32_t)TIMER3:
                IRQn = TIMER3_IRQn;
                break;
#endif
#if defined(TIMER4) && defined(TIMER4_IRQn)
            case(uint32_t)TIMER4:
                IRQn = TIMER4_IRQn;
                break;
#endif
#if defined(TIMER5) && defined(TIMER5_IRQn)
            case(uint32_t)TIMER5:
                IRQn = TIMER5_IRQn;
                break;
#endif
#if defined(TIMER6) && defined(TIMER6_IRQn)
            case(uint32_t)TIMER6:
                IRQn = TIMER6_IRQn;
                break;
#endif
#if defined(TIMER7) && defined(TIMER7_IRQn)
            case(uint32_t)TIMER7:
                IRQn = TIMER7_Channel_IRQn;
                break;
#endif
#if defined(TIMER8) && defined(TIMER8_IRQn)
            case(uint32_t)TIMER8:
                IRQn = TIMER8_IRQn;
                break;
#endif
#if defined(TIMER9) && defined(TIMER9_IRQn)
            case(uint32_t)TIMER9:
                IRQn = TIMER9_IRQn;
                break;
#endif
#if defined(TIMER10) && defined(TIMER10_IRQn)
            case(uint32_t)TIMER10:
                IRQn = TIMER10_IRQn;
                break;
#endif
#if defined(TIMER11) && defined(TIMER11_IRQn)
            case(uint32_t)TIMER11:
                IRQn = TIMER11_IRQn;
                break;
#endif
#if defined(TIMER12) && defined(TIMER12_IRQn)
            case(uint32_t)TIMER12:
                IRQn = TIMER12_IRQn;
                break;
#endif
#if defined(TIMER13) && defined(TIMER13_IRQn)
            case(uint32_t)TIMER13:
                IRQn = TIMER13_IRQn;
                break;
#endif
            default:
                break;
        }
    }
    return IRQn;
}

/*!
    \brief      timer interrupt handler
    \param[in]  timer: TIMERx(x=0..13)
    \param[out] none
    \retval     none
*/
void timerinterrupthandle(uint32_t timer)
{
    if(timer_interrupt_flag_get(timer, TIMER_INT_FLAG_UP) != RESET) {
        timer_interrupt_flag_clear(timer, TIMER_INT_FLAG_UP);
        if(timerHandle.interruptHandle) {
            timerHandle.interruptHandle(timer);
        }
    } else if(timer_interrupt_flag_get(timer, TIMER_INT_FLAG_CH0) != RESET) {
        timer_interrupt_flag_clear(timer, TIMER_INT_FLAG_CH0);
        if(pwmHandle.interruptHandle) {
            pwmHandle.interruptHandle(timer, TIMER_CH_0);
        }
        if(timerHandle.captureInterruptHandle[0]) {
            timerHandle.captureInterruptHandle[0](timer, 0);
        }
    } else if(timer_interrupt_flag_get(timer, TIMER_INT_FLAG_CH1) != RESET) {
        timer_interrupt_flag_clear(timer, TIMER_INT_FLAG_CH1);
        if(pwmHandle.interruptHandle) {
            pwmHandle.interruptHandle(timer, TIMER_CH_1);
        }
        if(timerHandle.captureInterruptHandle[1]) {
            timerHandle.captureInterruptHandle[1](timer, 1);
        }
    } else if(timer_interrupt_flag_get(timer, TIMER_INT_FLAG_CH2) != RESET) {
        timer_interrupt_flag_clear(timer, TIMER_INT_FLAG_CH2);
        if(pwmHandle.interruptHandle) {
            pwmHandle.interruptHandle(timer, TIMER_CH_2);
        }
        if(timerHandle.captureInterruptHandle[2]) {
            timerHandle.captureInterruptHandle[2](timer, 2);
        }
    } else if(timer_interrupt_flag_get(timer, TIMER_INT_FLAG_CH3) != RESET) {
        timer_interrupt_flag_clear(timer, TIMER_INT_FLAG_CH3);
        if(pwmHandle.interruptHandle) {
            pwmHandle.interruptHandle(timer, TIMER_CH_3);
        }
        if(timerHandle.captureInterruptHandle[3]) {
            timerHandle.captureInterruptHandle[3](timer, 3);
        }
    }
}

#if defined(TIMER0)
void TIMER0_IRQHandler(void)
{
    timerinterrupthandle(TIMER0);
#if defined(TIMER9)
    timerinterrupthandle(TIMER9);
#endif
}

void TIMER0_Channel_IRQHandler(void)
{
    timerinterrupthandle(TIMER0);
}
#endif /* TIMER0/TIMER9 handler */

